{
    "version": "https://jsonfeed.org/version/1",
    "title": "Alexandre Serra",
    "feed_url": "undefined/rss/feed.json",
    "description": "Your blog description",
    "icon": "undefined/favicon.ico",
    "author": {
        "name": "Alexandre Serra"
    },
    "items": [
        {
            "id": "undefined/articles/web-design-patterns",
            "content_html": "<p>Modern web development sometimes looks complex. The terms SSR, SSG and SPA usually emerge in the vast majority of content out there. When I first heard about these names, I sure was confused. What are those? Which one to use? When to choose one over the other? Can multiple patterns be used in the same app? I’m going to break down these questions for you. Hopefully, at the end of this article, you will have a better understanding of them, and a finer capability to make better architectural decisions for your next project.</p>\n<h2>SSR (Server-Side Rendering)</h2>\n<p>In SSR, when a web page is requested, it is rendered on the server, served to the client, and finally rendered by the client.</p>\n<img alt=\"\" loading=\"lazy\" width=\"1400\" height=\"646\" decoding=\"async\" data-nimg=\"1\" style=\"color:transparent\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssr.188be324.webp&amp;w=1920&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssr.188be324.webp&amp;w=3840&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssr.188be324.webp&amp;w=3840&amp;q=75\"/>\n<p>Why is this useful? Imagine a templating system, like the Django templating system, where you have dynamic data like below.</p>\n<pre><code>Hello {{user.name}}!\n</code></pre>\n<p>Using SSR, the HTML&#x27;s dynamic content is evaluated at runtime, based on the server state, and returned to the client. So the HTML sent to the user is actually:</p>\n<pre><code>Hello John!\n</code></pre>\n<p>The browser (client-side) just has to render the page into the DOM and voilá, there&#x27;s the page.</p>\n<h2>SSG (Static-Site Generating)</h2>\n<img alt=\"\" loading=\"lazy\" width=\"1400\" height=\"646\" decoding=\"async\" data-nimg=\"1\" style=\"color:transparent\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssg.e8f29e65.webp&amp;w=1920&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssg.e8f29e65.webp&amp;w=3840&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fssg.e8f29e65.webp&amp;w=3840&amp;q=75\"/>\n<p>SSG has similarities with SSR. The page is also generated in the server, however, the page is rendered at build time. So, instead of rendering the page on the server upon the receival of a request, the page is already rendered in the server, waiting to be served to the client. I’ll discuss the advantages and disadvantages of this approach, and compare it with SSR further below.</p>\n<h2>SPA (Single-Page Application)</h2>\n<img alt=\"\" loading=\"lazy\" width=\"1400\" height=\"646\" decoding=\"async\" data-nimg=\"1\" style=\"color:transparent\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fspa.bd615c24.webp&amp;w=1920&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fspa.bd615c24.webp&amp;w=3840&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fspa.bd615c24.webp&amp;w=3840&amp;q=75\"/>\n<p>This approach is relatively new compared with the previous two. This is a result of the rapid growth of the internet, software, and hardware industries over the last two decades. With SPA, the server provides the user with an empty HTML page and Javascript. The latter is where the magic happens. When the browser receives the HTML + Javascript, it loads the Javascript. Once loaded, the JS takes place and, through a set of operations in the DOM, renders the necessary components to the page. The routing is then handled by the browser itself, not hitting the server. This is usually done through a frontend framework (or library) like React, Vue, or Angular.</p>\n<h3>Server-side rendering (SSR and SSG) vs Client-side rendering (SPA)</h3>\n<p><em>Note: in this section, when I mention SSR I mean both SSR and SSG, and CSR I mean SPA.</em></p>\n<ul>\n<li><strong>SSR allows better SEO</strong> (Search Engine Optimization) because the content doesn&#x27;t have to be loaded by Javascript like in CSR, so the search engine&#x27;s web crawlers can directly parse the information.</li>\n<li><strong>SSR is better for slow connections</strong> because the HTML is immediately provided, whereas in CSR the user sees a blank page until the Javascript is loaded and renders the page&#x27;s content.</li>\n<li><strong>SSR allows seeing content with Javascript disabled</strong>. I know it sounds bizarre, however, users can have it disabled, intentionally or not. See this link where some of these situations are exposed.</li>\n<li><strong>SSR first load is usually faster</strong> because it doesn&#x27;t need to fetch the whole website in a Javascript bundle as CSR does (some performance optimizations can be made in CSR to reduce this payload, like dynamic imports).</li>\n<li><strong>CSR is faster after the first load</strong> since there are no server requests to change pages, which makes it insanely fast.</li>\n<li><strong>CSR provides a better UX (user experience)</strong> because it gives a native-app feel to the page.</li>\n</ul>\n<h3>SSR vs SSG</h3>\n<p>The difference between these two is that in SSR the server needs to render the page before sending it to the user (render at runtime), and with SSG this is not necessary, because it&#x27;s done at build time. You may feel like &quot;why on earth should I use SSR then?&quot;. It&#x27;s simple: most websites usually have dynamic, stateful data (e.g.: user email/logo on the navbar when a user is logged in). This means we can&#x27;t pre-render at build time templates with this data, so the only way to have this data with SSG would be to import it via Javascript (which would defeat SSG&#x27;s core purpose).</p>\n<h3>When to use what?</h3>\n<p>All three approaches have their upsides and downsides. There&#x27;s no better option overall. You can potentially use all three in the same project. In this section, I&#x27;m going to give you some examples of practical cases.</p>\n<h3>The documentation website</h3>\n<p>Imagine you&#x27;re building React&#x27;s documentation. What would you want in it? Surely accessibility to a broad audience, including users with slow internet and event javascript disabled. SEO would also be a concern (you would want to have the users hitting the docs when they search for something React-related). With this, we can narrow it down to either SSR or SSG. Which one to choose? I would go for SSG. The documentation doesn&#x27;t have dynamic content, hence it would be both redundant and slower to render them on the server per request. With SSG, we would deliver the content to the client fast.</p>\n<p><em>Side note: React does actually use SSG for their docs (they use Gastby).</em></p>\n<h3>The blog</h3>\n<p>A blog has data being inserted on a regular basis. Both SEO and accessibility are requirements for a successful blog. So, we would be deciding between SSR and SSG. This time, I would go for SSR. This is due to the fact that we have dynamic data being inserted often, and we want to provide the user with the most up-to-date data.</p>\n<h3>The CRM (Customer Relationship Manager)</h3>\n<p>A CRM has different requirements. SEO isn&#x27;t a concern, since most of the pages are behind a login, hence the search engines can&#x27;t reach there. Users often access the CRM in a stable environment (usually in the office, with good internet speed and a capable computer). Therefore, using SPA would be my choice. It would provide a native app feel, which the users would appreciate. Note that we can use other rendering methods in the same project. For example, we could have SSG on the login and FAQ pages.</p>\n<h2>Final thoughts</h2>\n<p>The exposed techniques are the everyday basis of the modern web. A firm understanding of them helps developers make better architectural decisions, providing a better experience and creating better value for the end-user, which is ultimately what we aim at.</p>\n<p>I hope this article helped to understand these concepts. Any questions, feel free to contact me through LinkedIn!</p>",
            "url": "undefined/articles/web-design-patterns",
            "title": "Web design patterns — SSR, SSG, and SPA",
            "summary": "Breaking down this hot modern web terms.",
            "date_modified": "2021-08-10T00:00:00.000Z",
            "author": {
                "name": "Alexandre Serra"
            }
        }
    ]
}